server/app/controllers/location_controller.rb

  def index
    @feedback = current_user.feedbacks.build()
    @spots = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"

  def create_feedback
    @feedback = current_user.feedbacks.build(set_params)
    sanitation = @feedback.sanitation.to_i
    crowd = @feedback.crowd.to_i
    lighting = @feedback.lighting.to_i

    feed = (sanitation+crowd+lighting)/3
    feed = feed.round

    @feedback.feed = feed
    if @feedback.save
---
INSERT INTO "feedbacks" ("feed", "user_id", "created_at", "updated_at", "lighting", "crowd") VALUES (?, ?, ?, ?, ?, ?)  [["feed", 5], ["user_id", 1], ["created_at", "2019-01-12 07:20:25.661832"], ["updated_at", "2019-01-12 07:20:25.661832"], ["lighting", 7], ["crowd", 8]]