server/app/controllers/api/v1/get_nearby_controller.rb

    def get_locations
        @feedback = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"